---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.PointLoadType
source: html/6d773c64-f5c2-232d-1d1f-db39b2307eb8.htm
---
# PointLoadType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.